[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:19:45
 
     // Public API
 
-    async findAll(): Promise<BankAccount[]> {
-        const data = await this.readFile()
-        return data.map(this.toDomain)
-    }
+    async findAll(): Promise<BankAccount[]> {}
 
     async findById(id: number): Promise<BankAccount | null> {
killedBy: JsonBankAccountRepository should return all accounts
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:24:61
         return data.map(this.toDomain)
     }
 
-    async findById(id: number): Promise<BankAccount | null> {
-        const data = await this.readFile()
-        return this.findAccountInCollection(data, id)
-    }
+    async findById(id: number): Promise<BankAccount | null> {}
 
     async save(account: BankAccount): Promise<void> {
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:29:53
         return this.findAccountInCollection(data, id)
     }
 
-    async save(account: BankAccount): Promise<void> {
-        const data = await this.readFile()
-        const updated = this.upsertAccount(data, account)
-        await this.writeFile(updated)
-    }
+    async save(account: BankAccount): Promise<void> {}
 
     // File Handling
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:37:70
 
     // File Handling
 
-    private async readFile(): Promise<BankAccountPersistenceModel[]> {
-        try {
-            const raw = await fs.readFile(this.filePath, "utf-8")
-            return JSON.parse(raw)
-        } catch {
-            return []
-        }
-    }
+    private async readFile(): Promise<BankAccountPersistenceModel[]> {}
 
     private async writeFile(data: BankAccountPersistenceModel[]): Promise<void> {
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: Cannot read properties of undefined (reading 'findIndex')

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:38:13
     // File Handling
 
     private async readFile(): Promise<BankAccountPersistenceModel[]> {
-        try {
-            const raw = await fs.readFile(this.filePath, "utf-8")
-            return JSON.parse(raw)
-        } catch {
+        try {} catch {
             return []
         }
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: Cannot read properties of undefined (reading 'findIndex')

[NoCoverage] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:41:17
         try {
             const raw = await fs.readFile(this.filePath, "utf-8")
             return JSON.parse(raw)
-        } catch {
-            return []
-        }
+        } catch {}
     }
 

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:46:81
         }
     }
 
-    private async writeFile(data: BankAccountPersistenceModel[]): Promise<void> {
-        await fs.writeFile(this.filePath, JSON.stringify(data, null, 2))
-    }
+    private async writeFile(data: BankAccountPersistenceModel[]): Promise<void> {}
 
     // Mapping
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:52:84
 
     // Mapping
 
-    private readonly toDomain = (raw: BankAccountPersistenceModel): BankAccount => {
-        return new BankAccount(
-            raw.id,
-            raw.userId,
-            raw.balance,
-            raw.movements ?? []
-        )
-    }
+    private readonly toDomain = (raw: BankAccountPersistenceModel): BankAccount => {}
 
     private toPersistence(account: BankAccount): BankAccountPersistenceModel {
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected undefined to be 1 // Object.is equality

[Killed] LogicalOperator
src/infrastructure/persistence/JsonBankAccountRepository.ts:57:13
             raw.id,
             raw.userId,
             raw.balance,
-            raw.movements ?? []
+            raw.movements && []
         )
     }
killedBy: JsonBankAccountRepository should persist movements correctly
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:61:78
         )
     }
 
-    private toPersistence(account: BankAccount): BankAccountPersistenceModel {
-        return {
-            id: account.id,
-            userId: account.userId,
-            balance: account.balance,
-            movements: account.movements
-        }
-    }
+    private toPersistence(account: BankAccount): BankAccountPersistenceModel {}
 
     // Encapsulated Collection Logic
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: Cannot read properties of null (reading 'id')

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:75:27
     private findAccountInCollection(
         data: BankAccountPersistenceModel[],
         id: number
-    ): BankAccount | null {
-
-        const found = data.find(acc => acc.id === id)
-        return found ? this.toDomain(found) : null
-    }
+    ): BankAccount | null {}
 
     private upsertAccount(
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/infrastructure/persistence/JsonBankAccountRepository.ts:77:40
         id: number
     ): BankAccount | null {
 
-        const found = data.find(acc => acc.id === id)
+        const found = data.find(acc => acc.id !== id)
         return found ? this.toDomain(found) : null
     }
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonBankAccountRepository.ts:77:40
         id: number
     ): BankAccount | null {
 
-        const found = data.find(acc => acc.id === id)
+        const found = data.find(acc => false)
         return found ? this.toDomain(found) : null
     }
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonBankAccountRepository.ts:84:38
     private upsertAccount(
         data: BankAccountPersistenceModel[],
         account: BankAccount
-    ): BankAccountPersistenceModel[] {
-
-        const serialized = this.toPersistence(account)
-        const index = data.findIndex(acc => acc.id === account.id)
-
-        return index === -1
-            ? [...data, serialized]
-            : data.map(acc =>
-                acc.id === account.id ? serialized : acc
-            )
-    }
+    ): BankAccountPersistenceModel[] {}
 }
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonBankAccountRepository.ts:87:45
     ): BankAccountPersistenceModel[] {
 
         const serialized = this.toPersistence(account)
-        const index = data.findIndex(acc => acc.id === account.id)
+        const index = data.findIndex(acc => true)
 
         return index === -1
killedBy: JsonBankAccountRepository should update an existing bank account
statusReason: expected undefined to be 2000 // Object.is equality

[Killed] ArrowFunction
src/infrastructure/persistence/JsonBankAccountRepository.ts:87:38
     ): BankAccountPersistenceModel[] {
 
         const serialized = this.toPersistence(account)
-        const index = data.findIndex(acc => acc.id === account.id)
+        const index = data.findIndex(() => undefined)
 
         return index === -1
killedBy: JsonBankAccountRepository should update an existing bank account
statusReason: expected 1000 to be 2000 // Object.is equality

[Killed] EqualityOperator
src/infrastructure/persistence/JsonBankAccountRepository.ts:89:16
         const serialized = this.toPersistence(account)
         const index = data.findIndex(acc => acc.id === account.id)
 
-        return index === -1
+        return index !== -1
             ? [...data, serialized]
             : data.map(acc =>
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonBankAccountRepository.ts:89:16
         const serialized = this.toPersistence(account)
         const index = data.findIndex(acc => acc.id === account.id)
 
-        return index === -1
+        return true
             ? [...data, serialized]
             : data.map(acc =>
killedBy: JsonBankAccountRepository should update an existing bank account
statusReason: expected 1000 to be 2000 // Object.is equality

[Survived] ArrowFunction
src/infrastructure/persistence/JsonBankAccountRepository.ts:91:24
 
         return index === -1
             ? [...data, serialized]
-            : data.map(acc =>
-                acc.id === account.id ? serialized : acc
+            : data.map(() => undefined
             )
     }

[Killed] EqualityOperator
src/infrastructure/persistence/JsonBankAccountRepository.ts:92:17
         return index === -1
             ? [...data, serialized]
             : data.map(acc =>
-                acc.id === account.id ? serialized : acc
+                acc.id !== account.id ? serialized : acc
             )
     }
killedBy: JsonBankAccountRepository should update an existing bank account
statusReason: expected 1000 to be 2000 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonBankAccountRepository.ts:92:17
         return index === -1
             ? [...data, serialized]
             : data.map(acc =>
-                acc.id === account.id ? serialized : acc
+                false ? serialized : acc
             )
     }
killedBy: JsonBankAccountRepository should update an existing bank account
statusReason: expected 1000 to be 2000 // Object.is equality
