[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:18:38
 
     // Public API
 
-    async findAll(): Promise<User[]> {
-        const data = await this.readFile()
-        return data.map(this.toDomain)
-    }
+    async findAll(): Promise<User[]> {}
 
     async findById(id: number): Promise<User | null> {
killedBy: JsonUserRepository should return all users
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:23:54
         return data.map(this.toDomain)
     }
 
-    async findById(id: number): Promise<User | null> {
-        const data = await this.readFile()
-        return this.findUserInCollection(data, id)
-    }
+    async findById(id: number): Promise<User | null> {}
 
     async save(user: User): Promise<void> {
killedBy: JsonUserRepository should save a new user
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:28:43
         return this.findUserInCollection(data, id)
     }
 
-    async save(user: User): Promise<void> {
-        const data = await this.readFile()
-        const updated = this.upsertUser(data, user)
-        await this.writeFile(updated)
-    }
+    async save(user: User): Promise<void> {}
 
     // Private File Operations
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:36:63
 
     // Private File Operations
 
-    private async readFile(): Promise<UserPersistenceModel[]> {
-        try {
-            const data = await fs.readFile(this.filePath, "utf-8")
-            return JSON.parse(data);
-        } catch {
-            return []
-        }
-    }
+    private async readFile(): Promise<UserPersistenceModel[]> {}
 
     private async writeFile(data: UserPersistenceModel[]): Promise<void> {
killedBy: JsonUserRepository should save a new user
statusReason: Cannot read properties of undefined (reading 'findIndex')

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:37:13
     // Private File Operations
 
     private async readFile(): Promise<UserPersistenceModel[]> {
-        try {
-            const data = await fs.readFile(this.filePath, "utf-8")
-            return JSON.parse(data);
-        } catch {
+        try {} catch {
             return []
         }
killedBy: JsonUserRepository should save a new user
statusReason: Cannot read properties of undefined (reading 'findIndex')

[Survived] StringLiteral
src/infrastructure/persistence/JsonUserRepository.ts:38:59
 
     private async readFile(): Promise<UserPersistenceModel[]> {
         try {
-            const data = await fs.readFile(this.filePath, "utf-8")
+            const data = await fs.readFile(this.filePath, "")
             return JSON.parse(data);
         } catch {

[NoCoverage] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:40:17
         try {
             const data = await fs.readFile(this.filePath, "utf-8")
             return JSON.parse(data);
-        } catch {
-            return []
-        }
+        } catch {}
     }
 

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:45:74
         }
     }
 
-    private async writeFile(data: UserPersistenceModel[]): Promise<void> {
-        await fs.writeFile(this.filePath, JSON.stringify(data, null, 2))
-    }
+    private async writeFile(data: UserPersistenceModel[]): Promise<void> {}
 
     // Private Mapping
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:51:70
 
     // Private Mapping
 
-    private readonly toDomain = (raw: UserPersistenceModel): User => {
-        return new User(
-            raw.id,
-            raw.dni,
-            raw.name,
-            raw.email
-        )
-    }
+    private readonly toDomain = (raw: UserPersistenceModel): User => {}
 
     private toPersistence(user: User): UserPersistenceModel {
killedBy: JsonUserRepository should save a new user
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:60:61
         )
     }
 
-    private toPersistence(user: User): UserPersistenceModel {
-        return {
-            id: user.id,
-            dni: user.dni,
-            name: user.name,
-            email: user.email
-        }
-    }
+    private toPersistence(user: User): UserPersistenceModel {}
 
     // Private Encapsulated Logic
killedBy: JsonUserRepository should save a new user
statusReason: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
src/infrastructure/persistence/JsonUserRepository.ts:61:16
     }
 
     private toPersistence(user: User): UserPersistenceModel {
-        return {
-            id: user.id,
-            dni: user.dni,
-            name: user.name,
-            email: user.email
-        }
+        return {}
     }
 
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:74:20
     private findUserInCollection(
         data: UserPersistenceModel[],
         id: number
-    ): User | null {
-
-        const found = data.find(u => u.id === id);
-        return found ? this.toDomain(found) : null
-    }
+    ): User | null {}
 
     private upsertUser(
killedBy: JsonUserRepository should save a new user
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonUserRepository.ts:76:38
         id: number
     ): User | null {
 
-        const found = data.find(u => u.id === id);
+        const found = data.find(u => false);
         return found ? this.toDomain(found) : null
     }
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] EqualityOperator
src/infrastructure/persistence/JsonUserRepository.ts:76:38
         id: number
     ): User | null {
 
-        const found = data.find(u => u.id === id);
+        const found = data.find(u => u.id !== id);
         return found ? this.toDomain(found) : null
     }
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] BlockStatement
src/infrastructure/persistence/JsonUserRepository.ts:83:31
     private upsertUser(
         data: UserPersistenceModel[],
         user: User
-    ): UserPersistenceModel[] {
-
-        const serialized = this.toPersistence(user)
-        const index = data.findIndex(u => u.id === user.id)
-
-        return index === -1
-            ? [...data, serialized]
-            : data.map(u => u.id === user.id ? serialized : u)
-    }
+    ): UserPersistenceModel[] {}
 }
killedBy: JsonUserRepository should save a new user
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] EqualityOperator
src/infrastructure/persistence/JsonUserRepository.ts:86:43
     ): UserPersistenceModel[] {
 
         const serialized = this.toPersistence(user)
-        const index = data.findIndex(u => u.id === user.id)
+        const index = data.findIndex(u => u.id !== user.id)
 
         return index === -1
killedBy: JsonUserRepository should update an existing user
statusReason: expected 'Juan' to be 'Juan Updated' // Object.is equality

[Killed] ArrowFunction
src/infrastructure/persistence/JsonUserRepository.ts:86:38
     ): UserPersistenceModel[] {
 
         const serialized = this.toPersistence(user)
-        const index = data.findIndex(u => u.id === user.id)
+        const index = data.findIndex(() => undefined)
 
         return index === -1
killedBy: JsonUserRepository should update an existing user
statusReason: expected 'Juan' to be 'Juan Updated' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonUserRepository.ts:88:16
         const serialized = this.toPersistence(user)
         const index = data.findIndex(u => u.id === user.id)
 
-        return index === -1
+        return false
             ? [...data, serialized]
             : data.map(u => u.id === user.id ? serialized : u)
killedBy: JsonUserRepository should save a new user
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/infrastructure/persistence/JsonUserRepository.ts:90:29
 
         return index === -1
             ? [...data, serialized]
-            : data.map(u => u.id === user.id ? serialized : u)
+            : data.map(u => false ? serialized : u)
     }
 }
killedBy: JsonUserRepository should update an existing user
statusReason: expected 'Juan' to be 'Juan Updated' // Object.is equality

[Killed] EqualityOperator
src/infrastructure/persistence/JsonUserRepository.ts:90:29
 
         return index === -1
             ? [...data, serialized]
-            : data.map(u => u.id === user.id ? serialized : u)
+            : data.map(u => u.id !== user.id ? serialized : u)
     }
 }
killedBy: JsonUserRepository should update an existing user
statusReason: expected 'Juan' to be 'Juan Updated' // Object.is equality
