[Killed] BlockStatement
src/application/services/BankAccountService.ts:13:77
         private readonly userRepository: IUserRepository
     ) {}
 
-    async createAccount(id: number, userId: number, initialBalance: number) {
-        await this.ensureUserExists(userId)
-        await this.ensureAccountDoesNotExist(id)
-
-        const account = new BankAccount(id, userId, initialBalance);
-        await this.accountRepository.save(account)
-
-        return account
-    }
+    async createAccount(id: number, userId: number, initialBalance: number) {}
 
     async deposit(accountId: number, amount: number) {
killedBy: BankAccountService Should create account if user exists and account does not exist
statusReason: expected undefined to be an instance of BankAccount

[Killed] BlockStatement
src/application/services/BankAccountService.ts:23:54
         return account
     }
 
-    async deposit(accountId: number, amount: number) {
-        const account = await this.ensureAccountExists(accountId)
-
-        account.deposit(amount)
-
-        await this.accountRepository.save(account)
-        return account.balance
-    }
+    async deposit(accountId: number, amount: number) {}
 
     async withdraw(accountId: number, amount: number) {
killedBy: BankAccountService Should deposit and return new balance
statusReason: expected undefined to be 150 // Object.is equality

[Killed] BlockStatement
src/application/services/BankAccountService.ts:32:55
         return account.balance
     }
 
-    async withdraw(accountId: number, amount: number) {
-        const account = await this.ensureAccountExists(accountId)
-
-        account.withdraw(amount)
-
-        await this.accountRepository.save(account)
-        return account.balance
-    }
+    async withdraw(accountId: number, amount: number) {}
 
     async checkBalance(accountId: number) {
killedBy: BankAccountService Should withdraw and return new balance
statusReason: expected undefined to be 150 // Object.is equality

[Killed] BlockStatement
src/application/services/BankAccountService.ts:41:43
         return account.balance
     }
 
-    async checkBalance(accountId: number) {
-        const account = await this.ensureAccountExists(accountId)
-        return account.balance
-    }
+    async checkBalance(accountId: number) {}
 
     async getMovements(accountId: number) {
killedBy: BankAccountService Should return balance if account exists
statusReason: expected undefined to be 500 // Object.is equality

[Killed] BlockStatement
src/application/services/BankAccountService.ts:46:43
         return account.balance
     }
 
-    async getMovements(accountId: number) {
-        const account = await this.ensureAccountExists(accountId)
-        return account.movements
-    }
+    async getMovements(accountId: number) {}
 
     async getAccountWithUser(accountId: number) {
killedBy: BankAccountService Should return movements if account exists
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/application/services/BankAccountService.ts:51:49
         return account.movements
     }
 
-    async getAccountWithUser(accountId: number) {
-        const account = await this.ensureAccountExists(accountId)
-        const user = await this.ensureUserExists(account.userId)
-
-        return {
-            accountId: account.id,
-            balance: account.balance,
-            movements: account.movements,
-            user: {
-                id: user.id,
-                dni: user.dni,
-                name: user.name,
-                email: user.email
-            }
-        }
-    }
+    async getAccountWithUser(accountId: number) {}
 
     // Validators
killedBy: BankAccountService Should return account with user data
statusReason: expected undefined to deeply equal { accountId: 1, balance: 500, …(2) }

[Killed] BlockStatement
src/application/services/BankAccountService.ts:69:67
     }
 
     // Validators
-    private async ensureUserExists(userId: number): Promise<User> {
-        const user = await this.userRepository.findById(userId)
-        if (!user) {
-            throw new Error("User does not exist")
-        }
-        return user
-    }
+    private async ensureUserExists(userId: number): Promise<User> {}
 
     private async ensureAccountExists(accountId: number): Promise<BankAccount> {
killedBy: BankAccountService Should throw if user does not exist
statusReason: promise resolved "BankAccount{ id: 10, userId: 1, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/services/BankAccountService.ts:71:13
     // Validators
     private async ensureUserExists(userId: number): Promise<User> {
         const user = await this.userRepository.findById(userId)
-        if (!user) {
+        if (false) {
             throw new Error("User does not exist")
         }
killedBy: BankAccountService Should throw if user does not exist
statusReason: promise resolved "BankAccount{ id: 10, userId: 1, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/services/BankAccountService.ts:71:13
     // Validators
     private async ensureUserExists(userId: number): Promise<User> {
         const user = await this.userRepository.findById(userId)
-        if (!user) {
+        if (true) {
             throw new Error("User does not exist")
         }
killedBy: BankAccountService Should create account if user exists and account does not exist
statusReason: User does not exist

[Killed] StringLiteral
src/application/services/BankAccountService.ts:72:29
     private async ensureUserExists(userId: number): Promise<User> {
         const user = await this.userRepository.findById(userId)
         if (!user) {
-            throw new Error("User does not exist")
+            throw new Error("")
         }
         return user
killedBy: BankAccountService Should throw if user does not exist
statusReason: expected [Function] to throw error including 'User does not exist' but got ''

[Killed] BlockStatement
src/application/services/BankAccountService.ts:77:80
         return user
     }
 
-    private async ensureAccountExists(accountId: number): Promise<BankAccount> {
-        const account = await this.accountRepository.findById(accountId)
-        if (!account) {
-            throw new Error("Account not found")
-        }
-        return account
-    }
+    private async ensureAccountExists(accountId: number): Promise<BankAccount> {}
 
     private async ensureAccountDoesNotExist(accountId: number): Promise<void> {
killedBy: BankAccountService Should deposit and return new balance
statusReason: Cannot read properties of undefined (reading 'deposit')

[Killed] BooleanLiteral
src/application/services/BankAccountService.ts:79:13
 
     private async ensureAccountExists(accountId: number): Promise<BankAccount> {
         const account = await this.accountRepository.findById(accountId)
-        if (!account) {
+        if (account) {
             throw new Error("Account not found")
         }
killedBy: BankAccountService Should deposit and return new balance
statusReason: Account not found

[Killed] ConditionalExpression
src/application/services/BankAccountService.ts:79:13
 
     private async ensureAccountExists(accountId: number): Promise<BankAccount> {
         const account = await this.accountRepository.findById(accountId)
-        if (!account) {
+        if (true) {
             throw new Error("Account not found")
         }
killedBy: BankAccountService Should deposit and return new balance
statusReason: Account not found

[Killed] BlockStatement
src/application/services/BankAccountService.ts:85:79
         return account
     }
 
-    private async ensureAccountDoesNotExist(accountId: number): Promise<void> {
-        const existing = await this.accountRepository.findById(accountId)
-        if (existing) {
-            throw new Error(`Account with ID ${accountId} already exists`)
-        }
-    }
+    private async ensureAccountDoesNotExist(accountId: number): Promise<void> {}
 }
killedBy: BankAccountService Should throw if account already exists
statusReason: promise resolved "BankAccount{ id: 10, userId: 1, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/application/services/BankAccountService.ts:87:13
 
     private async ensureAccountDoesNotExist(accountId: number): Promise<void> {
         const existing = await this.accountRepository.findById(accountId)
-        if (existing) {
+        if (true) {
             throw new Error(`Account with ID ${accountId} already exists`)
         }
killedBy: BankAccountService Should create account if user exists and account does not exist
statusReason: Account with ID 10 already exists

[Killed] BlockStatement
src/application/services/BankAccountService.ts:87:23
 
     private async ensureAccountDoesNotExist(accountId: number): Promise<void> {
         const existing = await this.accountRepository.findById(accountId)
-        if (existing) {
-            throw new Error(`Account with ID ${accountId} already exists`)
-        }
+        if (existing) {}
     }
 }
killedBy: BankAccountService Should throw if account already exists
statusReason: promise resolved "BankAccount{ id: 10, userId: 1, …(2) }" instead of rejecting
