[Killed] BlockStatement
src/domain/entities/BankAccount.ts:13:7
         public readonly userId: number, 
         initialBalance: number,
         movements: Movement[] = []
-    ) {
-
-        this.validateInitialBalance(initialBalance)
-        this._balance = initialBalance;
-        this._movements = movements;
-    }
+    ) {}
 
     get balance(): number {
killedBy: BankAccountService Should deposit and return new balance
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:20:27
         this._movements = movements;
     }
 
-    get balance(): number {
-        return this._balance;
-    }
+    get balance(): number {}
 
     get movements(): Movement[] {
killedBy: BankAccountService Should deposit and return new balance
statusReason: expected undefined to be 150 // Object.is equality

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:24:33
         return this._balance;
     }
 
-    get movements(): Movement[] {
-        return [...this._movements];
-    }
+    get movements(): Movement[] {}
 
     deposit(amount: number): void {
killedBy: BankAccountService Should return movements if account exists
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:28:35
         return [...this._movements];
     }
 
-    deposit(amount: number): void {
-        this.validatePositiveAmount(amount)
-        this._balance += amount;
-        this._movements.push({
-            id: Date.now(),
-            type: MovementType.DEPOSIT,
-            amount,
-            date: new Date()
-        });
-    }
+    deposit(amount: number): void {}
 
     withdraw(amount: number): void {
killedBy: BankAccount Entity Should store and return the movements correctly
statusReason: Insufficient balance

[Killed] AssignmentOperator
src/domain/entities/BankAccount.ts:30:9
 
     deposit(amount: number): void {
         this.validatePositiveAmount(amount)
-        this._balance += amount;
+        this._balance -= amount;
         this._movements.push({
             id: Date.now(),
killedBy: BankAccountService Should deposit and return new balance
statusReason: expected 50 to be 150 // Object.is equality

[Killed] ObjectLiteral
src/domain/entities/BankAccount.ts:31:30
     deposit(amount: number): void {
         this.validatePositiveAmount(amount)
         this._balance += amount;
-        this._movements.push({
-            id: Date.now(),
-            type: MovementType.DEPOSIT,
-            amount,
-            date: new Date()
-        });
+        this._movements.push({});
     }
 
killedBy: BankAccountService Should return movements if account exists
statusReason: expected undefined to be 50 // Object.is equality

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:39:36
         });
     }
 
-    withdraw(amount: number): void {
-        this.validatePositiveAmount(amount)
-        this.validateFunds(amount)
-        this._balance -= amount;
-        this._movements.push({
-            id: Date.now(),
-            type: MovementType.WITHDRAW,
-            amount,
-            date: new Date()
-        });
-    }
+    withdraw(amount: number): void {}
     
     // Validators
killedBy: BankAccount Entity Should store and return the movements correctly
statusReason: expected [ { id: 1772841270546, …(3) } ] to have a length of 2 but got 1

[Killed] AssignmentOperator
src/domain/entities/BankAccount.ts:42:9
     withdraw(amount: number): void {
         this.validatePositiveAmount(amount)
         this.validateFunds(amount)
-        this._balance -= amount;
+        this._balance += amount;
         this._movements.push({
             id: Date.now(),
killedBy: BankAccountService Should withdraw and return new balance
statusReason: expected 250 to be 150 // Object.is equality

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:52:58
     }
     
     // Validators
-    private validateInitialBalance(amount: number): void {
-        if (amount < 0) {
-            throw new Error("Initial balance cannot be negative");
-        }
-    }
+    private validateInitialBalance(amount: number): void {}
 
     private validatePositiveAmount(amount: number): void {
killedBy: BankAccount Entity Should throw an error if initial balance is negative
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/domain/entities/BankAccount.ts:53:13
     
     // Validators
     private validateInitialBalance(amount: number): void {
-        if (amount < 0) {
+        if (amount >= 0) {
             throw new Error("Initial balance cannot be negative");
         }
killedBy: JsonBankAccountRepository should save a new bank account
statusReason: Initial balance cannot be negative

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:53:25
     
     // Validators
     private validateInitialBalance(amount: number): void {
-        if (amount < 0) {
-            throw new Error("Initial balance cannot be negative");
-        }
+        if (amount < 0) {}
     }
 
killedBy: BankAccount Entity Should throw an error if initial balance is negative
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
src/domain/entities/BankAccount.ts:54:29
     // Validators
     private validateInitialBalance(amount: number): void {
         if (amount < 0) {
-            throw new Error("Initial balance cannot be negative");
+            throw new Error("");
         }
     }

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:58:58
         }
     }
 
-    private validatePositiveAmount(amount: number): void {
-        if (amount <= 0) {
-            throw new Error("Amount must be greater than 0")
-        }
-    }
+    private validatePositiveAmount(amount: number): void {}
 
     private validateFunds(amount: number): void {
killedBy: BankAccount Entity Should throw an error if deposit amount is INVALID (less than or equal to 0)
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:59:26
     }
 
     private validatePositiveAmount(amount: number): void {
-        if (amount <= 0) {
-            throw new Error("Amount must be greater than 0")
-        }
+        if (amount <= 0) {}
     }
 
killedBy: BankAccount Entity Should throw an error if deposit amount is INVALID (less than or equal to 0)
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/domain/entities/BankAccount.ts:59:13
     }
 
     private validatePositiveAmount(amount: number): void {
-        if (amount <= 0) {
+        if (amount < 0) {
             throw new Error("Amount must be greater than 0")
         }
killedBy: BankAccount Entity Should throw an error if deposit amount is INVALID (less than or equal to 0)
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:64:49
         }
     }
 
-    private validateFunds(amount: number): void {
-        if (this.balance < amount) {
-            throw new Error("Insufficient balance")
-        }
-    }
+    private validateFunds(amount: number): void {}
 }
killedBy: BankAccount Entity Should throw an error if try to withdraw more than the available balance
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/domain/entities/BankAccount.ts:65:13
     }
 
     private validateFunds(amount: number): void {
-        if (this.balance < amount) {
+        if (this.balance <= amount) {
             throw new Error("Insufficient balance")
         }
killedBy: BankAccount Entity Should to allow withdraw VALID money from an account
statusReason: Insufficient balance

[Killed] BlockStatement
src/domain/entities/BankAccount.ts:65:36
     }
 
     private validateFunds(amount: number): void {
-        if (this.balance < amount) {
-            throw new Error("Insufficient balance")
-        }
+        if (this.balance < amount) {}
     }
 }
killedBy: BankAccount Entity Should throw an error if try to withdraw more than the available balance
statusReason: expected function to throw an error, but it didn't
